# SubSchemaGUID Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Field..::..SubSchemaGUID Property
Field Class See Also
---
The GUID of the Schema describing the subentity (or subentities) stored in this Field.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public Guid SubSchemaGUID { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SubSchemaGUID As Guid
	Get
```

Visual C++
---
```text
public:
property Guid SubSchemaGUID {
	Guid get ();
}
```

# See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace